xml/getDataStructureDefinition.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:sdmx="http://stats.oecd.org/OECDStatWS/SDMX/">
   <soap:Header/>
   <soap:Body>
      <sdmx:GetDataStructureDefinition>
         <!--Optional:-->
<message:QueryMessage xmlns="http://www.SDMX.org/resources/SDMXML/schemas/v2_0/query" xmlns:message="http://www.SDMX.org/resources/SDMXML/schemas/v2_0/message" xsi:schemaLocation="http://www.SDMX.org/resources/SDMXML/schemas/v2_0/query http://www.sdmx.org/docs/2_0/SDMXQuery.xsd 
   http://www.SDMX.org/resources/SDMXML/schemas/v2_0/message http://www.sdmx.org/docs/2_0/SDMXMessage.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                 <message:Query>
                                 <KeyFamilyWhere>
<Or>
</Or>
                                 </KeyFamilyWhere>
                 </message:Query>
 </message:QueryMessage>
      </sdmx:GetDataStructureDefinition>
   </soap:Body>
</soap:Envelope>
